Natalia-Test/integrator/ACAMO-integrator-tool/templates/iCMoreCreateOffer

<soapenv:Envelope xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="urn:crmondemand/ws/ecbs/customobject1/" xmlns:data="urn:/crmondemand/xml/CustomObject1/Data">
   <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>${headers.soapConnectorProperties.icMoreUsername}</wsse:Username>
            <wsse:Password Type="wsse:PasswordText">${headers.soapConnectorProperties.icMorePassword}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <cus:CustomObject1Insert_Input>
         <data:ListOfCustomObject1>
            <!--Zero or more repetitions:-->
            <data:CustomObject1 operation="CustomObject1Insert">
			 <!--Optional:-->
               <data:ExternalSystemId>${getCountryQueue(body.variables.Miles_country)}_${body.variables.Miles_eventobject.idnumber}</data:ExternalSystemId>
               <#-- What is idnumber? -->
               <data:Name>${body.variables.Miles_eventobject.idnumber}</data:Name>
               <#-- No businesspartnerid and no contactid -->
               <data:AccountExternalSystemId>${getCountryQueue(body.variables.Miles_country)}_${body.variables.Miles_eventobject.customerid}</data:AccountExternalSystemId>
               <data:ContactExternalSystemId>${getCountryQueue(body.variables.Miles_country)}_${body.variables.Miles_eventobject.driverid}</data:ContactExternalSystemId>
               <data:OpportunityExternalSystemId>${getCountryQueue(body.variables.Miles_country)}_${body.variables.Miles_eventobject.idnumber}</data:OpportunityExternalSystemId>
               <data:CustomBoolean0>true</data:CustomBoolean0>
            </data:CustomObject1>
         </data:ListOfCustomObject1>
      </cus:CustomObject1Insert_Input>
   </soapenv:Body>
</soapenv:Envelope>